## 데이터베이스와 JPA

### ORM은 무엇이고 왜 필요할까요?
- ORM: 자바의 객체와 데이터베이스를 연결하는 프로그래밍 기법. 데이터베이스의 값을 마치 객체처럼 사용하는 것.
- ORM의 필요성(장점)
  - SQL을 직접 작성하지 않고 사용하는 언어로 데이터베이스에 접근할 수 있음.
  - 객체지향적으로 코드를 작성할 수 있기 때문에 비즈니스 로직에만 집중할 수 있음.
  - 매핑하는 정보가 명확하기 때문에 ERD에 대한 의존도를 낮출 수 있고 유지보수할 때 유리함.
  - ORM 프레임워크는 다양한 데이터베이스를 지원하기 때문에 데이터베이스 시스템을 변경하더라도 코드 수정이 최소화 → 데이터베이스 종속성 감소

### 스프링에서 ORM을 어떻게 활용하나요?
JPA (Java Persistence API) 표준을 구현한 Hibernate와 그 위에 구축된 Spring Data JPA를 통해 ORM 활용
*jPA: 자바 객체와 데이터베이스를 연결하는 다리 역할. ORM의 여러 종류 중 자바에서는 JPA를 표준으로 사용*
*Hibernate: ORM 프레임워크*

### Spring Data JPA란 무엇일까요?
- Spring data: 클라이언트의 요청에 따라 데이터를 가져오는 상황에서 스프링 데이터가 이를 Repository 영역이 담당하도록 강제하여 데이터를 가공하여 응답하는 Service 영역과 분리되도록 함.
- Spring Data JPA: JPA를 더 편리하게 사용하는 메서드를 제공함.
 - Repository 인터페이스(JPA를 추상화 시킨 인터페이스를 정의하면 자동으로 구현체를 생성, 이를 통해 **CRUD 작업을 위한 코드 중복 감소**)
 - 쿼리 메소드
 - 페이징과 정렬 기능

 ### Repository Layer란 무엇일까요?
 데이터 저장소와의 상호작용을 담당하는 계층으로, 주로 엔티티의 CRUD와 같은 데이터 영속성 작업을 추상화함.

### JpaRepository Interface에는 어떤 기능들이 포함되어 있나요?
데이터베이스의 추가, 조회, 수정, 삭제의 findAll(), findById(), save() 등의 메서드 등등

---

### Entity는 무엇인가요?
객체 지향 프로그래밍에서 데이터베이스 테이블과 매핑되는 객체.

### 2. 영속성은 무엇일까요?
데이터를 생성한 프로그램이 종료되어도 사라지지 않고 영구적으로 보존되는 특성.
데이터가 메모리(RAM)에만 존재하지 않고, 하드 디스크나 데이터베이스와 같은 영구 저장소에 저장되어 애플리케이션의 생명주기 이상으로 지속되는 것.

 ### Entity의 생명주기는 어떻게 되나요?


 (추가 예정)




